vvpai9/Keil/Keil_v5/ARM/INC/Nuvoton/NUC501/NUC501.h
/**************************************************************************//**
 * @file     NUC501.h
 * @brief    Peripheral Access Layer Header File for 
 *           for the Nuvoton NUC501 Device Series
 * @version  V1.00
 * @date     11. May 2010
 *
 * @note
 * Copyright (C) 2010 ARM Limited. All rights reserved.
 *
 * @par
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
 * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 ******************************************************************************/


#ifndef __NUC501_H__
#define __NUC501_H__

#ifdef __cplusplus
 extern "C" {
#endif 

#include <stdint.h>                           /* Include standard types */

/**
 * IO definitions
 *
 * define access restrictions to peripheral registers
 */

#ifdef __cplusplus
  #define     __I     volatile                /*!< defines 'read only' permissions      */
#else
  #define     __I     volatile const          /*!< defines 'read only' permissions      */
#endif
#define     __O     volatile                  /*!< defines 'write only' permissions     */
#define     __IO    volatile                  /*!< defines 'read / write' permissions   */


/** @addtogroup NUC501_Definitions NUC501 Definitions
  This file defines all structures and symbols for NUC501:
    - Registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
  @{
*/



/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/*------------- System Manager Control (GCR) ---------------------------------*/
/** @addtogroup NUC501_GCR NUC501 System Manager Control Block 
  @{
*/
typedef struct {
  __I  uint32_t PDID;                   /*!< Offset: 0x000 (R/ ) Product Identification Register */
  __IO uint32_t SPOCR;                  /*!< Offset: 0x004 (R/W) System Power-On Configuration Register */
  __IO uint32_t CPUCR;                  /*!< Offset: 0x008 (R/W) CPU Control Register */
  __IO uint32_t MISCR;                  /*!< Offset: 0x00C (R/W) Miscellaneous Control Register */
       uint32_t RESERVED0[1];
  __IO uint32_t IPRST;                  /*!< Offset: 0x014 (R/W) IP Reset Control Resister */
       uint32_t RESERVED1[2];
  __IO uint32_t AHB_CTRL;               /*!< Offset: 0x020 (R/W) AHB Bus Control register */
       uint32_t RESERVED2[3];
  __IO uint32_t PAD_REG[3];             /*!< Offset: 0x030 (R/W) PAD function */
       uint32_t RESERVED3[14];
  __IO uint32_t GP_DS;                  /*!< Offset: 0x074 (R/W) GPIO pads driving strength control */
} NUC_GCR_TypeDef;
/*@}*/ /* end of group NUC501_GCR */


/*------------- Clock Control (CLK) ------------------------------------------*/
/** @addtogroup NUC501_CLK NUC501 Clock Control Block 
  @{
*/
typedef struct {
  __IO uint32_t PWRCON;                 /*!< Offset: 0x000 (R/W) System Power Down Control Register */
  __IO uint32_t AHBCLK;                 /*!< Offset: 0x004 (R/W) AHB Device Clock Enable Control Register */
  __IO uint32_t APBCLK;                 /*!< Offset: 0x008 (R/W) APB Device Clock Enable Control Register */
       uint32_t RESERVED0[1];
  __IO uint32_t CLKSEL;                 /*!< Offset: 0x010 (R/W) Clock Source Select Control Register */
  __IO uint32_t CLKDIV0;                /*!< Offset: 0x014 (R/W) Clock Divider Number Register 0 */
  __IO uint32_t CLKDIV1;                /*!< Offset: 0x018 (R/W) Clock Divider Number Register 1 */
       uint32_t RESERVED1[1];
  __IO uint32_t MPLLCON;                /*!< Offset: 0x020 (R/W) MPLL Control Register */
} NUC_CLK_TypeDef;
/*@}*/ /* end of group NUC501_CLK */


/*------------- SRAM Control (SRAMCTL) ------------------------------------------*/
/** @addtogroup NUC501_SRAMCTL NUC501 SRAM Control 
  @{
*/
typedef struct {
  __IO uint32_t CR[16];                 /*!< Offset: 0x000 (R/W) SRAM Control Register */
} NUC_SRAMCTL_TypeDef;
/*@}*/ /* end of group NUC501_SRAMCTL */


/*------------- Serial Peripheral Interface Master Mode (SPIM) ----------------------------*/
/** @addtogroup NUC501_SPIM NUC501 Serial Peripheral Interface Master Mode
  @{
*/
typedef struct
{
  __IO uint32_t CNTRL;                  /*!< Offset: 0x000 (R/W) Control and Status Register */
  __IO uint32_t DIVIDER;                /*!< Offset: 0x004 (R/W) Clock Divider Register */
  __IO uint32_t SSR;                    /*!< Offset: 0x008 (R/W) Slave Select Register */
       uint32_t RESERVED0[1];
  __I  uint32_t RX[4];                  /*!< Offset: 0x010 (R/ ) Data Receive Register */
  __O  uint32_t TX[4];                  /*!< Offset: 0x020 ( /W) Data Transmit Register */
  __IO uint32_t AHB_ADDR;               /*!< Offset: 0x030 (R/W) AHB memory address */
  __IO uint32_t CODE_LEN;               /*!< Offset: 0x034 (R/W) Boot code length */
       uint32_t RESERVED1[2];
  __IO uint32_t SPIM_ADDR;              /*!< Offset: 0x040 (R/W) SPI Flash Start Address */
} NUC_SPIM_TypeDef;
/*@}*/ /* end of group NUC501_SPIM */


/*------------- Audio Processing Unit (APU) ------------------------------------------*/
/** @addtogroup NUC501_APU NUC501 Audio Processing Unit 
  @{
*/
typedef struct {
  __IO uint32_t APUCON;                 /*!< Offset: 0x000 (R/W) APU Control Register */
  __IO uint32_t PARCON;                 /*!< Offset: 0x004 (R/W) Parameter Control Register */
  __IO uint32_t PDCON;                  /*!< Offset: 0x008 (R/W) Power Down Control Register */
  __IO uint32_t APUINT;                 /*!< Offset: 0x00C (R/W) APU Interrupt Register */
  __IO uint32_t RAMBSAD;                /*!< Offset: 0x010 (R/W) RAM Base Address Register */
  __IO uint32_t THAD1;                  /*!< Offset: 0x014 (R/W) Threshold 1 Address Register */
  __IO uint32_t THAD2;                  /*!< Offset: 0x018 (R/W) Threshold 2 Address Register */
  __I  uint32_t CURAD;                  /*!< Offset: 0x01C (R/ ) Current Access RAM Address Register */
} NUC_APU_TypeDef;
/*@}*/ /* end of group NUC501_APU */


/*------------- USB Device Control (USB) ------------------------------------------*/
/** @addtogroup NUC501_USB NUC501 USB Device Control Block 
  @{
*/
typedef struct {

  __IO uint32_t BUFSEG;                 /*!< Offset: +0x00 (R/W) Buffer Segmentation of endpoint */
  __IO uint32_t MXPLD;                  /*!< Offset: +0x04 (R/W) Maximal payload of endpoint */
  __IO uint32_t CFG;                    /*!< Offset: +0x08 (R/W) Configuration of endpoint */
  __IO uint32_t CFGP;                   /*!< Offset: +0x0C (R/W) In ready clear flag of endpoint */
} NUC_USB_EP_TypeDef;

