vvpai9/Keil/Keil_v5/ARM/INC/Nuvoton/NUC501/NUC501.h
/*------------- Serial Peripheral Interface (SPI) ----------------------------*/
/** @addtogroup NUC501_SPI NUC501 Serial Peripheral Interface 
  @{
*/
typedef struct
{
  __IO uint32_t CNTRL;                  /*!< Offset: 0x000 (R/W) Control and Status Register */
  __IO uint32_t DIVIDER;                /*!< Offset: 0x004 (R/W) Clock Divider Register */
  __IO uint32_t SSR;                    /*!< Offset: 0x008 (R/W) Slave Select Register */
       uint32_t RESERVED0[1];
  union {
  __I  uint32_t RX[4];                  /*!< Offset: 0x010 (R/ ) Data Receive Register */
  __O  uint32_t TX[4];                  /*!< Offset: 0x010 ( /W) Data Transmit Register */
  };
} NUC_SPI_TypeDef;
/*@}*/ /* end of group NUC501_SPI */


/*------------- Timer (TMR) ----------------------------*/
/** @addtogroup NUC501_TMR NUC501 Timer 
  @{
*/
typedef struct
{
  __IO uint32_t TCSR0;                  /*!< Offset: 0x000 (R/W) Timer Control and Status Register 0 */
  __IO uint32_t TCSR1;                  /*!< Offset: 0x004 (R/W) Timer Control and Status Register 1 */
  __IO uint32_t TICR0;                  /*!< Offset: 0x008 (R/W) Timer Initial Control Register 0 */
  __IO uint32_t TICR1;                  /*!< Offset: 0x00C (R/W) Timer Initial Control Register 1 */
  __I  uint32_t TDR0;                   /*!< Offset: 0x010 (R/ ) Timer Data Register 0 */
  __I  uint32_t TDR1;                   /*!< Offset: 0x014 (R/ ) Timer Data Register 1 */
  __IO uint32_t TISR;                   /*!< Offset: 0x018 (R/W) Timer Interrupt Status Register */
} NUC_TMR_TypeDef;
/*@}*/ /* end of group NUC501_TMR */


/*------------- Watchdog Timer (WDT) ----------------------------*/
/** @addtogroup NUC501_TIM NUC501 Watchdog Timer 
  @{
*/
typedef struct
{
  __IO uint32_t CR;                     /*!< Offset: 0x000 (R/W) Watchdog Timer Control Register */
} NUC_WDT_TypeDef;
/*@}*/ /* end of group NUC501_WDT */


/*------------- UART Interface (UART) ----------------------------*/
/** @addtogroup NUC501_UART NUC501 UART Interface 
  @{
*/
typedef struct
{
  union {
  __I  uint32_t RBR;                    /*!< Offset: 0x000 (R/ ) Receive Buffer Register (DLAB = 0) */
  __O  uint32_t THR;                    /*!< Offset: 0x000 ( /W) Transmit Holding Register (DLAB = 0) */
  __IO uint32_t DLL;                    /*!< Offset: 0x000 (R/W) Divisor Latch Register (LS) (DLAB = 1) */
  };
  union {
  __IO uint32_t IER;                    /*!< Offset: 0x004 (R/W) Interrupt Enable Register (DLAB = 0) */
  __IO uint32_t DLM;                    /*!< Offset: 0x004 (R/W) Divisor Latch Register (MS) (DLAB = 1) */
  };
  union {
  __I  uint32_t IIR;                    /*!< Offset: 0x008 (R/ ) Interrupt Identification Register */
  __O  uint32_t FCR;                    /*!< Offset: 0x008 ( /W) FIFO Control Register */
  };
  __IO uint32_t LCR;                    /*!< Offset: 0x00C (R/W) Line Control Register */
  __IO uint32_t MCR;                    /*!< Offset: 0x010 (R/W) Modem Control Register */
  __I  uint32_t LSR;                    /*!< Offset: 0x014 (R/ ) Line Status Register */
  __IO uint32_t MSR;                    /*!< Offset: 0x018 (R/W) Modem Status Register */
  __IO uint32_t TOR;                    /*!< Offset: 0x01C (R/W) Time Out Register */
} NUC_UART_TypeDef;
/*@}*/ /* end of group NUC501_UART */


#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif


/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/* Base addresses                                                             */
#define NUC_FLASH_BASE          ((     uint32_t)0x40000000)
#define NUC_SRAM_BASE           ((     uint32_t)0x00000000)
#define NUC_AHB_BASE            ((     uint32_t)0xB1000000)
#define NUC_APB_BASE            ((     uint32_t)0xB8000000)

/* AHB peripherals                                                            */	
#define NUC_GCR_BASE            (NUC_AHB_BASE       + 0x00000)
#define NUC_CLK_BASE            (NUC_AHB_BASE       + 0x00200)
#define NUC_SRAMCTL_BASE        (NUC_AHB_BASE       + 0x04000)
#define NUC_SPIM_BASE           (NUC_AHB_BASE       + 0x07000)
#define NUC_APU_BASE            (NUC_AHB_BASE       + 0x08000)
#define NUC_USB_BASE            (NUC_AHB_BASE       + 0x09000)

/* APB1 peripherals                                                            */	
#define NUC_ADC_BASE            (NUC_APB_BASE       + 0x01000)
#define NUC_AIC_BASE            (NUC_APB_BASE       + 0x02000)
#define NUC_GPIO_BASE           (NUC_APB_BASE       + 0x03000)
#define NUC_I2C_BASE            (NUC_APB_BASE       + 0x04000)
#define NUC_PWM_BASE            (NUC_APB_BASE       + 0x07000)
#define NUC_RTC_BASE            (NUC_APB_BASE       + 0x08000)
#define NUC_SPI_BASE            (NUC_APB_BASE       + 0x0A000)
#define NUC_TMR_BASE            (NUC_APB_BASE       + 0x0B000)  
#define NUC_WDT_BASE            (NUC_APB_BASE       + 0x0B01C)  
#define NUC_UART0_BASE          (NUC_APB_BASE       + 0x0C000)
#define NUC_UART1_BASE          (NUC_APB_BASE       + 0x0C100)


/******************************************************************************/
/*                         Peripheral declaration                             */
/******************************************************************************/
#define NUC_GCR               ((NUC_GCR_TypeDef    *) NUC_GCR_BASE    )
#define NUC_CLK               ((NUC_CLK_TypeDef    *) NUC_CLK_BASE    )
#define NUC_SRAMCTL           ((NUC_SRAMCTL_TypeDef*) NUC_SRAMCTL_BASE)
#define NUC_SPIM              ((NUC_SPIM_TypeDef   *) NUC_SPIM_BASE   )
#define NUC_APU               ((NUC_APU_TypeDef    *) NUC_APU_BASE    )
#define NUC_USB               ((NUC_USB_TypeDef    *) NUC_USB_BASE    )

#define NUC_ADC       	      ((NUC_ADC_TypeDef    *) NUC_ADC_BASE    )
#define NUC_AIC               ((NUC_AIC_TypeDef    *) NUC_AIC_BASE    )
#define NUC_GPIO              ((NUC_GPIO_TypeDef   *) NUC_GPIO_BASE   ) 
#define NUC_I2C               ((NUC_I2C_TypeDef    *) NUC_I2C_BASE    )
#define NUC_PWM               ((NUC_PWM_TypeDef    *) NUC_PWM_BASE    )
#define NUC_RTC               ((NUC_RTC_TypeDef    *) NUC_RTC_BASE    )
#define NUC_SPI               ((NUC_SPI_TypeDef    *) NUC_SPI_BASE    )
#define NUC_TMR               ((NUC_TMR_TypeDef    *) NUC_TMR_BASE    )
#define NUC_WDT               ((NUC_WDT_TypeDef    *) NUC_WDT_BASE    )
#define NUC_UART0             ((NUC_UART_TypeDef   *) NUC_UART0_BASE  )
#define NUC_UART1             ((NUC_UART_TypeDef   *) NUC_UART1_BASE  )


#ifdef __cplusplus
}
#endif

#endif  /* __NUC501_H__ */
